tap "jurplel/tap"
tap "mediosz/tap"
tap "nikitabobko/tap"
# GNU internationalization (i18n) and localization (l10n) library
brew "gettext"
# Manage your dotfiles across multiple diverse machines, securely
brew "chezmoi"
# Dependency manager for Cocoa projects
brew "cocoapods"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# Fast and simple Node.js version manager
brew "fnm"
# Command-line fuzzy finder written in Go
brew "fzf"
# App development framework of Golang
brew "gf"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Database migrations CLI tool
brew "golang-migrate"
# Run and Test HTTP Requests with plain text and curl
brew "hurl"
# Tools and libraries to manipulate images in select formats
brew "imagemagick"
# Simple terminal UI for git commands
brew "lazygit"
# Fast and powerful Git hooks manager for any type of projects
brew "lefthook"
# Library to render SVG files using Cairo
brew "librsvg"
# Deep clean and optimize your Mac
brew "mole"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# PNG image optimizing utility
brew "pngquant"
# Fast, disk space efficient package manager
brew "pnpm"
# Convert bitmaps to vector graphics
brew "potrace"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Cross-shell prompt for astronauts
brew "starship"
# Formatting tool for reformatting Swift code
brew "swiftformat"
# Terminal multiplexer
brew "tmux"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Generate your Xcode project from a spec file and your folder structure
brew "xcodegen"
# Desktop password and login vault
cask "bitwarden"
# OpenAI's official ChatGPT desktop app
cask "chatgpt"
cask "font-jetbrains-mono-nerd-font"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Native instant workspace switching
cask "jurplel/tap/instant-space-switcher"
